Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.authentik_system.data.kubernetes_service_v1.authentik_server: Reading...
module.authentik_system.data.kubernetes_service_v1.authentik_server: Read complete after 0s [id=authentik/authentik-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # module.longhorn_system.helm_release.longhorn will be updated in-place
~ resource "helm_release" "longhorn" {
      ~ id                         = "longhorn" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.9.0" -> (known after apply)
          ~ chart          = "longhorn" -> (known after apply)
          ~ first_deployed = 1732591142 -> (known after apply)
          ~ last_deployed  = 1753235858 -> (known after apply)
          ~ name           = "longhorn" -> (known after apply)
          ~ namespace      = "longhorn-system" -> (known after apply)
          ~ notes          = <<-EOT
                Longhorn is now installed on the cluster!
                
                Please wait a few minutes for other Longhorn components such as CSI deployments, Engine Images, and Instance Managers to be initialized.
                
                Visit our documentation at https://longhorn.io/docs/
            EOT -> (known after apply)
          ~ revision       = 10 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - defaultSettings = {
                      - backupTarget                 = "s3://longhorn-backups.billv.ca@us-east-1/"
                      - backupTargetCredentialSecret = "longhorn-backups-credentials"
                      - backupstorePollInterval      = 0
                    }
                }
            ) -> (known after apply)
          ~ version        = "1.9.0" -> (known after apply)
        } -> (known after apply)
        name                       = "longhorn"
      ~ version                    = "1.9.0" -> "1.9.1"
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-base-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```